{
  "url": "https://dccdialysis.com/blog/avoiding-the-thanksgiving-pitfalls-3/",
  "title": "Avoiding Thanksgiving Pitfalls: Essential Tips for Care",
  "text": "Dialysis Care Center About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Admissions Find A Center Find A Center Search Search Close this search box. Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Avoiding the Thanksgiving Pitfalls November 01, 2021 As we enter November, it’s a sign that the holiday season is approaching. Thanksgiving welcomes us, allowing us to reconnect with our loved ones. Since the holiday is food-centric, navigating as a dialysis patient can be daunting. “What should I eat? What should I avoid? How do I communicate my needs without feeling like a burden?” If you’ve asked yourself any of these questions, you will find solutions below to avoid the holiday pitfalls. Don’t stress; we’re here to help you enjoy the food and loved ones you love. Although they may need a little education, you will often find that your loved ones support your needs and want to provide food that everyone, including you, can enjoy. If you are attending Thanksgiving dinner, it may be a good idea to cook one or two kidney-friendly dishes that you know you will be able to eat. Ask your host what they plan to serve beforehand so that you can help fill in the gaps with your favorite dishes. Show your loved ones that kidney-friendly foods can be healthy and delicious, so bring enough to share! Always remember the importance of portion control. Just because a dish isn’t kidney-friendly doesn’t mean you must avoid it altogether. Proper portion control can help you keep yourself in check, allow a little leeway, and prevent you from derailing your usual diet. Some commonly consumed Thanksgiving foods can be high in phosphorus and potassium – macaroni and cheese, gravy, yams, sweet potatoes, and mashed potatoes, to name a few. If you decide to indulge in any foods you know may not be the best for you, limit your portions to less than ½ cup and try to avoid seconds and thirds. Be mindful of canned and processed foods – boxed stuffing, cranberry sauce, gravy mixes, fried meats, powdered mashed potatoes, and premade desserts – as these foods can be high in phosphorus and phosphorus additives. You can make these items from scratch at home to decrease the phosphorus content. Make sure to bring and take your phosphorus binders with you for your meal. Talk to your doctor or dietitian about taking an extra binder with your big meal; this would help cover the excess food or phosphorus you may consume. Watching what we consume does not only apply to the foods we choose but also to the drinks. Some great holiday favorites include lemon-lime soda, ginger ale, Fresca, club soda, cranberry, apple, and grapes juices. If you have diabetes, be sure to watch your sugar levels and opt for lower-sugar or sugar-free varieties. Be careful to stay within your fluid recommendations, typically between 32 and 48 ounces per day. Make sure to speak with your dietitian regarding any questions you may have. We at Dialysis Care Center wish you and your family a very joyous and healthy holiday season! Author Raag Shanker, RDN, LD Renal Registered Dietitian AuthorRaag Shanker, RDN, LDRenal Registered Dietitian Dialysis Care Center AL AK AZ AR CA CO CT DE FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY DC Explore LocationsServicesDCC CaresEventsNews Useful Links CareersMy DCCPartnersContact UsBlogsPay My Bill DCC Customer Care Center 708-713-5080 Useful Links Locations | Services | DCC Care | Careers | Contact Us Admissions 844-466-3436 309-808-4352 admissions@dccdialysis.com​ Admissions: 844-466-3436 309-808-4352 admissions@dccdialysis.com​ This site is for informational purposes only and is not intended to be a substitute for professional medical advice, diagnosis or treatment.© 2025. DIALYSIS CARE CENTER. ALL RIGHTS RESERVED #LeadingwithCare Chair-time schedule guaranteed within 2 hours Talk to our admissions specialist Call 844-466-3436 or email us at admissions@dccdialysis.com​"
}