{
  "url": "https://dccdialysis.com/blog/holiday-meal-planning/",
  "title": "Holiday Meal Planning Tips for Dialysis Patients",
  "text": "Dialysis Care Center About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Admissions Find A Center Find A Center Search Search Close this search box. Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Holiday Meal Planning November 10, 2022 Don’t become overwhelmed while trying to plan a renal-friendly holiday meal. Use the suggestions below to make dinner planning easier and to wow yourself and your loved ones!Making your Holiday Meal Kidney-Friendly Choose a high protein entréeRoast pork, roasted chicken or turkey, or a tenderloin make for a delicious and protein-rich main entrée to help maintain your albumin. Avoid proteins injected with sodium phosphate additives; check the ingredient list for the letters “p h o s.” Make homemade gravy and use fresh and dried seasonings and herbs to make it flavorful. Deviled eggs and quiche can be great high-protein appetizers and sides. Choose low potassium vegetable and fruit sidesGlazed carrots, sauteed cabbage, roasted cauliflower, steamed green beans.Leach or double boil potatoes and sweet potatoes to decrease the potassium content.Make your cranberry sauce from scratch as an alternative to the sugary canned versions. High fiber starchesMake homemade stuffing to avoid the high phosphorus and sodium that can be found in the boxed mixes.Spice up rice pilaf or wild rice with caramelized onions, cranberries, julienned carrots or roasted yellow squash.Dinner rolls, buttered noodles Low potassium and phosphorus dessertsChoose fruit pies like apple, cheery and peach cobbler are better options than pumpkin, sweet potato, and pecan pies or chocolate desserts.Angel food cake, pound cake and carrot cake are also great options. Use non-dairy whipped topping, check the ingredient list for the letters “p h o s”. Control your fluid intakeDuring dinner, choose one 8-ounce drink and sip on it slowly. Talk to your doctor about alcohol, and consume in moderation. Choose lemon lime soda, ginger ale, sparkling cider, hot cider and low potassium juices. Avoid hot chocolate and eggnog as they are higher in phosphorus. Enjoying your MealMake sure to enjoy a hearty, protein-rich breakfast so that you aren’t starving by dinner. Keep your phosphorus binders handy. Use smaller plates and cups to monitor serving sizes. AuthorRaag Shanker, RDN, LDRenal Registered Dietitian Dialysis Care Center AL AK AZ AR CA CO CT DE FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY DC Explore LocationsServicesDCC CaresEventsNews Useful Links CareersMy DCCPartnersContact UsBlogsPay My Bill DCC Customer Care Center 708-713-5080 Useful Links Locations | Services | DCC Care | Careers | Contact Us Admissions 844-466-3436 309-808-4352 admissions@dccdialysis.com​ Admissions: 844-466-3436 309-808-4352 admissions@dccdialysis.com​ This site is for informational purposes only and is not intended to be a substitute for professional medical advice, diagnosis or treatment.© 2025. DIALYSIS CARE CENTER. ALL RIGHTS RESERVED #LeadingwithCare Chair-time schedule guaranteed within 2 hours Talk to our admissions specialist Call 844-466-3436 or email us at admissions@dccdialysis.com​"
}