{
  "url": "https://dccdialysis.com/blog/physical-activity-reduces-heart-related-deaths-in-hemodialysis-patients/",
  "title": "Physical Activity Reduces Heart-Related Deaths in Dialysis",
  "text": "Dialysis Care Center About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Admissions Find A Center Find A Center Search Search Close this search box. Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Physical Activity Reduces Heart-Related Deaths in Hemodialysis Patients October 13, 2021 Regular physical activity is directly associated with a longer life expectancy in hemodialysis patients and reduces heart-related deaths. These results came from a new study on 6147 European and Argentinian patients receiving hemodialysis. The study defined physical activity as participating in activities like work, household chores, travel, or leisure. Heart-related deaths included sudden death, heart attack, atherosclerotic heart disease, cardiac arrhythmia, cardiac arrest, valvular heart disease, pulmonary edema, and congestive heart failure. Occasional physical activity was associated with a 20% lower risk for overall deaths and an 18% lower risk for heart-related deaths. Frequent physical activity was associated with an 18% lower risk for overall fatalities and a 23% lower risk for heart-related deaths. As physical activity increased, the risk of heart-related deaths significantly decreased. Investigators adjusted results for patients’ diets. These results show that even low levels of physical activities without risk of injuries can yield a positive effect on lowering the risk for death in these patients – Dr. Bernier-Jean’s team concluded during the study. This study also encourages future randomized controlled trials of low-intensity physical activity for sedentary adults receiving hemodialysis. Author Dr. Umair Haider AuthorRaag Shanker, RDN, LDRenal Registered Dietitian Dialysis Care Center AL AK AZ AR CA CO CT DE FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY DC Explore LocationsServicesDCC CaresEventsNews Useful Links CareersMy DCCPartnersContact UsBlogsPay My Bill DCC Customer Care Center 708-713-5080 Useful Links Locations | Services | DCC Care | Careers | Contact Us Admissions 844-466-3436 309-808-4352 admissions@dccdialysis.com​ Admissions: 844-466-3436 309-808-4352 admissions@dccdialysis.com​ This site is for informational purposes only and is not intended to be a substitute for professional medical advice, diagnosis or treatment.© 2025. DIALYSIS CARE CENTER. ALL RIGHTS RESERVED #LeadingwithCare Chair-time schedule guaranteed within 2 hours Talk to our admissions specialist Call 844-466-3436 or email us at admissions@dccdialysis.com​"
}