{
  "url": "https://dccdialysis.com/blog/love-your-heart/",
  "title": "Love Your Heart: Essential Care for Dialysis Patients",
  "text": "Dialysis Care Center About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Admissions Find A Center Find A Center Search Search Close this search box. Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Love Your Heart: Tips to Keep Your Heart Healthy on Dialysis February 3, 2023 Heart disease and stroke are the number one and three, respectively, leading cause of death in the United States. Both conditions are prevalent in people with kidney disease or failure due to the conditions and risk factors that force your heart to work harder. Following these tips can help you lower your risk of getting heart disease or help keep heart disease from progressing. Control Blood Sugars if You Have Diabetes Monitor your blood sugar levels regularly as per your doctor’s recommendation. Sticking to your prescribed treatment plan, which includes taking medications, following a healthy diet, and engaging in physical activity, is essential. Control High Blood Pressure Take all your blood pressure medications as prescribed. Keeping your blood pressure readings in a notebook or treatment log is also essential. Maintain sodium (no more than 2000 mg/day) and fluid restriction (32-48 oz/day). Reduce High Cholesterol Levels Have the following labs checked annually: total cholesterol, HDL “good” cholesterol, LDL “bad” cholesterol, and triglycerides. If your levels are not in a healthy range, follow a low-fat diet, increase exercise, and ask about cholesterol-lowering medication if necessary. Follow a Heart-Healthy Diet Eat foods low in saturated fats, sodium, and phosphorus (less than 200 mg per serving). Include more foods high in heart-healthy omega-3 fatty acids, such as salmon, walnuts, flaxseeds, soybeans, and canola oil. Increase Physical Activity if Your Physician Allows Start slowly and aim to increase exercise to at least 30 minutes most days a week. Treat Anemia This helps keep the muscles on the left side of the heart from getting thick. If this muscle becomes thick, it is harder for the heart to pump blood. Keep Calcium and Phosphorus Levels in Balance Follow a low-phosphorus diet, take your phosphate binders with meals, and take your bone medications as prescribed. Stop Smoking Your physician or social worker can refer you to a program to help you quit. Reduce Stress Level Stressful feelings like worry, sadness, and anger can contribute to heart disease. Ask for help. Your social worker can teach you to cope with these feelings better. Maintain a Healthy Weight Maintaining the Body Mass Index (BMI) between 18.5 and 24.9 is considered healthy, but it’s essential to consult a doctor to determine the best weight for an individual’s overall health. Author Maggie Chung, MS RD LDN AuthorRaag Shanker, RDN, LDRenal Registered Dietitian Dialysis Care Center AL AK AZ AR CA CO CT DE FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY DC Explore LocationsServicesDCC CaresEventsNews Useful Links CareersMy DCCPartnersContact UsBlogsPay My Bill DCC Customer Care Center 708-713-5080 Useful Links Locations | Services | DCC Care | Careers | Contact Us Admissions 844-466-3436 309-808-4352 admissions@dccdialysis.com​ Admissions: 844-466-3436 309-808-4352 admissions@dccdialysis.com​ This site is for informational purposes only and is not intended to be a substitute for professional medical advice, diagnosis or treatment.© 2025. DIALYSIS CARE CENTER. ALL RIGHTS RESERVED #LeadingwithCare Chair-time schedule guaranteed within 2 hours Talk to our admissions specialist Call 844-466-3436 or email us at admissions@dccdialysis.com​"
}