{
  "url": "https://dccdialysis.com/blog/festive-feasting/",
  "title": "Festive Feasting - Dialysis Care Center",
  "text": "Dialysis Care Center About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Admissions Find A Center Find A Center Search Search Close this search box. Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Festive Feasting: How to Make Your Holiday Menu Kidney-Friendly December 02, 2022 The holidays make it difficult to follow any therapeutic diet. During this season, people usually spend time with their loved ones and celebrate customs that involve delicious meals. With some advanced planning, here is how you can ensure your holiday menus do not allow you to fall off your renal diet plan. Appetizers: The serving size of your appetizer should be smaller than your palm. Remember that potassium, phosphorus, and sodium are the hidden ingredients in many appetizers. Be mindful and limit appetizers. Here are some alternatives to typical appetizers. Raw Veggies: Peppers, carrots, cucumbers, radishes & celery sticks Low Potassium Fruits: Grapes, apples, berries Snacks: Deviled eggs, unsalted popcorn, unsalted pretzels Spreads: Pineapple salsa, cream cheese, low-sodium cheese Main Course: Portion control! The amount of meat/protein eaten should be the size of the palm of your hand or as much as a deck of cards. Fill half of your plate with preferred non-starchy vegetables. Starches should be no bigger than the size of your computer mouse. If using gravy, use no more than 2 tablespoons on your plate. Protein: Turkey, pork, chicken, duck Vegetables: Green salad, green beans, corn, zucchini, cauliflower Starches: White rice, noodles, white bread or rolls, “leached” potatoes, couscous Sides: Cranberry sauce, applesauce, low-sodium gravy Liquids: Reminder for your fluid intake: anything liquid at room temperature is a fluid, not just plain water. Water with lemon, sparkling water, iced tea, apple juice, cranberry juice, hot tea, coffee with non-dairy creamer Desserts: Enjoy a small portion of the treats below. If you have diabetes, you need to limit desserts or stick to lower-sugar ones. Fruit pies: apple, cherry, berry Cookies: sugar, shortbread Cakes: pound, angel food Candies: peppermint, gumdrops, jellybeans Author Maggie Chung, MS RD LDN AuthorRaag Shanker, RDN, LDRenal Registered Dietitian Dialysis Care Center AL AK AZ AR CA CO CT DE FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY DC Explore LocationsServicesDCC CaresEventsNews Useful Links CareersMy DCCPartnersContact UsBlogsPay My Bill DCC Customer Care Center 708-713-5080 Useful Links Locations | Services | DCC Care | Careers | Contact Us Admissions 844-466-3436 309-808-4352 admissions@dccdialysis.com​ Admissions: 844-466-3436 309-808-4352 admissions@dccdialysis.com​ This site is for informational purposes only and is not intended to be a substitute for professional medical advice, diagnosis or treatment.© 2025. DIALYSIS CARE CENTER. ALL RIGHTS RESERVED #LeadingwithCare Chair-time schedule guaranteed within 2 hours Talk to our admissions specialist Call 844-466-3436 or email us at admissions@dccdialysis.com​"
}