{
  "url": "https://dccdialysis.com/blog/halloween-for-dialysis-patients/",
  "title": "Halloween for Dialysis Patients: Tips for a Safe Celebration",
  "text": "Dialysis Care Center About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Admissions Find A Center Find A Center Search Search Close this search box. Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Halloween For Dialysis patients September 28, 2022 Here are some valuable tips by the DCC dietitian team on how to enjoy the Halloween season in a dialysis and kidney-friendly way. Tips for Surviving Halloween Avoid buying candies that aren’t dialysis-friendly; that way, you are not tempted. If you have diabetes, choose sugar-free or low-sugar candies. Avoid high phosphorus and high potassium ingredients in candy-like chocolate and nuts. Take a 10 to 15-minute walk or do a physical activity for each piece of candy you eat. Share! Give away leftover candy to friends or family. Acceptable Halloween Candies for Dialysis Patients ✓ Avoid These Candies X Candy Corn, Sweet Tarts, Red Licorice Chocolate candy bars Bulls-eye, Marshmallows, Sour Balls Chocolate and nut candy bars Butterscotch, Gummy Bears Candy bars that contain nuts Jolly Ranchers, Jelly Beans Candy bars with peanut butter Gum Drops, Peppermint Toffee JuJu Beans, Lifesavers Caramel treats Red Hots, Lemon Drops Chocolate wafer candy bars Lemon Heads, Chewing Gums Chocolate covered peppermint candies Phosphorus and Potassium Content of Different Candies Food Potassium (Mg) Phosphorus (Mg) Food Potassium (Mg) Phosphorus (Mg) Lollipop 0 0 Brownie (1 large square) 83 57 Lifesavers 0 0 Chocolate cake doughnut 64 97 Candy corn (1/4 C) 2 3 Almond Joy (1.7 oz) 120 69 Taffy (.5 oz) 1 0 Mounds (1.9 oz) 111 64 Skittles (2.3 oz) 3 1 Twix (2 oz) 115 68 Starburst fruit chews (6) 1 4 Kit Kat (1.5 oz) 126 73 Gumdrops (10 small) 2 0 M & M’s (1.69 oz) 128 72 Jelly beans (10 large) 10 1 Caramels (6 pieces) 152 81 Toffee (.42 oz) 6 4 M & M’ s peanut (1.74 oz) 169 93 Apple cider (from mix) 1 27 Raisinettes (1.58 oz) 231 65 York Peppermint Patty (1.5 oz) 49 40 Butterfinger (2.1 oz) 230 79 Glazed doughnut 42 58 Baby Ruth (2.1 oz) 238 91 Milky Way (snack size) 43 29 Snickers (2.1 oz) 206 113 3 Muskateers (2.13 oz) 80 55 Reese’s Peanut Butter cup (2) 176 120 Cherry Nibs (1 oz) 18 88 Pumpkin pie (1 slice) 288 152 Pumpkin seeds (1/4 C) 457 665 Homemade hot cocoa (1 C) 492 262 FOOD POTASSIUM (MG) PHOSPHORUS (MG) Lollipop 0 0 Lifesavers 0 0 Candy corn (1/4 C) 2 3 Taffy (.5 oz) 1 0 Skittles (2.3 oz) 3 1 Starburst fruit chews (6) 1 4 Gumdrops (10 small) 2 0 Jelly beans (10 large) 10 1 Toffee (.42 oz) 6 4 Apple cider (from mix) 1 27 York Peppermint Patty (1.5 oz) 49 40 Glazed doughnut 42 58 Milky Way (snack size) 43 29 3 Muskateers (2.13 oz) 80 55 Cherry Nibs (1 oz) 18 88 Brownie (1 large square) 83 57 Chocolate cake doughnut 64 97 Almond Joy (1.7 oz) 120 69 Mounds (1.9 oz) 111 64 Twix (2 oz) 115 68 Kit Kat (1.5 oz) 126 73 M & M’s (1.69 oz) 128 72 Caramels (6 pieces) 152 81 M & M’ s peanut (1.74 oz) 169 93 Raisinettes (1.58 oz) 231 65 Butterfinger (2.1 oz) 230 79 Baby Ruth (2.1 oz) 238 91 Snickers (2.1 oz) 206 113 Reese’s Peanut Butter cup (2) 176 120 Pumpkin pie (1 slice) 288 152 Homemade hot cocoa (1 C) 492 262 Pumpkin seeds (1/4 C) 457 665 AuthorRaag Shanker, RDN, LDRenal Registered Dietitian Dialysis Care Center AL AK AZ AR CA CO CT DE FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY DC Explore LocationsServicesDCC CaresEventsNews Useful Links CareersMy DCCPartnersContact UsBlogsPay My Bill DCC Customer Care Center 708-713-5080 Useful Links Locations | Services | DCC Care | Careers | Contact Us Admissions 844-466-3436 309-808-4352 admissions@dccdialysis.com​ Admissions: 844-466-3436 309-808-4352 admissions@dccdialysis.com​ This site is for informational purposes only and is not intended to be a substitute for professional medical advice, diagnosis or treatment.© 2025. DIALYSIS CARE CENTER. ALL RIGHTS RESERVED #LeadingwithCare Chair-time schedule guaranteed within 2 hours Talk to our admissions specialist Call 844-466-3436 or email us at admissions@dccdialysis.com​"
}