{
  "url": "https://dccdialysis.com/blog/falling-into-healthy-habits/",
  "title": "Falling into healthy habits | Dialysis Care Center",
  "text": "Dialysis Care Center About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Admissions Find A Center Find A Center Search Search Close this search box. Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Falling into healthy habits September 27, 2023 Fall is here! Our expert DCC dietitians are excited to share some essential tips for our dialysis patients. Our goal is to help our patients enjoy the season’s beauty while keeping their health in check. So, let’s dive in! Pack the Protein Keeping your albumin in the normal range is essential to help you fight infections, maintain proper fluid balance, and maintain strength and muscle function. You should aim for 2-4 ounces of high-quality protein at each meal. Animal protein examples are beef, chicken, eggs, turkey, fish, seafood Plant proteins like tofu, tempeh, quinoa, seitan Processed meats like hot doga, bacon, sausage, and bologna are lower-quality options Oral nutrition supplements can be a great way to add extra protein to your diet. You can talk to your dietitian about kidney-friendly options of oral nutrition supplements. Be Mindful of Your Phosphorus Intake High phosphorus levels are associated with cellular damage in the human body. An average phosphorus level is 3.5-5.5 mg/dL. You can keep your phosphorus level under control by understanding your diet and medications for phosphorus control. Choose low-phosphorus foods and proteins such as fresh poultry, lean beef, fish and seafood, and cottage cheese. Cook from scratch at home and limit intake of highly processed foods and eating out. Read food labels and avoid foods with “P-H-O-S” in the ingredients list, i.e., Monosodium phosphate, Phosphoric acid, and Dicalcium phosphate. If prescribed phosphorus binders, remember to take them with each meal. Be Mindful of Your Potassium Intake Your potassium levels should remain between 3.5 – 5.0mg/dL. A dialysis patient should not consume more than 2000mg of potassium daily. Too high or low potassium is dangerous as it affects your heart rate. Here are some ways to keep it in a normal range: Check with your dietitian or physician for the safe amount that works for you. Read food labels. Potassium is now commonly found on the nutrition facts label. Look for foods with no more than 200 mg of potassium per serving. Choose foods lower in potassium, such as apples, grapes, plums, berries, bell peppers, onions, carrots, cucumbers, lettuce, corn, and green beans. Limit intakes of Foods higher in potassium, such as potatoes & sweet potatoes, tomatoes, oranges, bananas, pumpkin, winter squash, and Brussels sprouts. Limit Your Sodium Most people with kidney disease should limit sodium intake to <2,300 mg/day. Some ways to decrease sodium intake are to: Buy fresh foods and cook from scratch more often because canned and prepackaged foods are often high in sodium Avoid high-sodium foods like pizza, chips, canned soups Rinse sodium-containing canned foods like beans and tuna Use spices, herbs, and sodium-free seasonings to flavor dishes Avoid salt substitutes as they can be high in potassium Always read the Nutrition Facts label in order to compare sodium content Choose light or reduced-sodium condiments Manage Your Fluids What is a fluid? A fluid is any liquid or anything that melts at room temperature. If you continue to make urine, you can drink up to 48 ounces (6 cups) of fluid each day. If you no longer produce urine, drink only 32 ounces (4 cups) of fluid daily. Speak to your nephrologist or renal dietitian about your specific fluid needs. Don’t Miss Dialysis Treatments Missing dialysis treatments can be very dangerous for you. It can: Make you feel sick Shorten your life expectancy Increase your risk of illness and infections Prevent you from getting on the transplant list Here are some tips to help you: Make sure to reschedule any missed treatments. Schedule medical appointments for non-dialysis days Speak to your clinic’s social worker if you are having transportation issues. Plan ahead with the social worker when traveling out of town. Take Medications as Prescribed In addition to following a renal diet and fluid restrictions, medicine can help you maintain a higher quality of Health Habits. Make sure to take all medications as prescribed. These can include: Blood pressure medications Phosphorus binders Calcitriol & Cinacalcet (to keep bones healthy) Renal multivitamins Vitamin D supplement Use a pill organizer to remember to take all your medications more easily. Prepare for Fall Travels Here are some tips to help you have a wonderful trip without risking your health. Check with your health insurance to see if they cover the cost of dialysis while traveling. Alert your social worker about your travel plans ahead of time so they may schedule treatments. Make sure you pack enough medication for your entire trip. Pack and plan to buy healthy meals, snacks, and drinks that follow the individual dietary recommendations that you’ve received from your dietitian. Read the menu before going to restaurants; Look for the keywords grilled, broiled, or baked when choosing entrees. Allow time to rest and recharge between activities; don’t push yourself. Lastly, Get Moving! In general, exercise can: Increase energy Improve digestion Improve blood pressure and blood sugar Reduce feelings of stress Here are some steps to get you started: Choose an activity that you enjoy Start with 10-15 minutes Workout with an accountability partner Set small goals for yourself Remember to always speak with your doctor before starting any new exercise program. AuthorRaag Shanker, RDN, LDRenal Registered Dietitian Dialysis Care Center AL AK AZ AR CA CO CT DE FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY DC Explore LocationsServicesDCC CaresEventsNews Useful Links CareersMy DCCPartnersContact UsBlogsPay My Bill DCC Customer Care Center 708-713-5080 Useful Links Locations | Services | DCC Care | Careers | Contact Us Admissions 844-466-3436 309-808-4352 admissions@dccdialysis.com​ Admissions: 844-466-3436 309-808-4352 admissions@dccdialysis.com​ This site is for informational purposes only and is not intended to be a substitute for professional medical advice, diagnosis or treatment.© 2025. DIALYSIS CARE CENTER. ALL RIGHTS RESERVED #LeadingwithCare Chair-time schedule guaranteed within 2 hours Talk to our admissions specialist Call 844-466-3436 or email us at admissions@dccdialysis.com​"
}