{
  "url": "https://dccdialysis.com/stories/celebrating-ten-years-of-service/",
  "title": "Celebrating Ten Years of Service at Dialysis Care Center",
  "text": "Dialysis Care Center About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Admissions Find A Center Find A Center Search Search Close this search box. Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Celebrating Ten Years of Service Mayra Guzman Dialysis Access Specialist When I began working at the Kidney Care Center (KCC) ten years ago, clinics still used paper charts nationwide. As medical technology evolved, so has my career with Kidney Care Center (KCC) and later Dialysis Care Center (DCC). Working in a dialysis center was not a career I saw for myself, but now I believe I was in the right place at the right time. I was introduced to dialysis as an intern at the Joliet clinic. At the time, I was studying to become a medical assistant. People ask me what drew me to work in dialysis care. It was a variety of work. I could work as a medical assistant and in other office departments. This variety has helped me advance my skills professionally over the last ten years. The more I learn, the better I can understand and care for our patients. My passion and growing experience helped me advance from Medical Assistant to Dialysis Access Specialist, the position I hold today. While working in dialysis care has unique challenges, I have never stopped being an enthusiastic champion for my patients. The most important thing I can provide is a familiar face to patients, so they know they are not going through the treatment alone. Showing patients they have a support system behind them is one of the most rewarding aspects of the job. Reflecting on my ten years with KCC and DCC, I realize it has been quite a journey. The family culture that initially drew me to the company ten years ago is still an integral part of my work today. I take pride in working for a company that celebrates employees with different cultures, backgrounds, and experiences. Working with a diverse group of people is what makes DCC feel like a family. Dialysis Care Center AL AK AZ AR CA CO CT DE FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY DC Explore LocationsServicesDCC CaresEventsNews Useful Links CareersMy DCCPartnersContact UsBlogsPay My Bill DCC Customer Care Center 708-713-5080 Useful Links Locations | Services | DCC Care | Careers | Contact Us Admissions 844-466-3436 309-808-4352 admissions@dccdialysis.com​ Admissions: 844-466-3436 309-808-4352 admissions@dccdialysis.com​ This site is for informational purposes only and is not intended to be a substitute for professional medical advice, diagnosis or treatment.© 2025. DIALYSIS CARE CENTER. ALL RIGHTS RESERVED #LeadingwithCare Chair-time schedule guaranteed within 2 hours Talk to our admissions specialist Call 844-466-3436 or email us at admissions@dccdialysis.com​"
}