{
  "url": "https://dccdialysis.com/stories/transforming-dialysis-care-inside-oak-lawns-state-of-the-art-facility/",
  "title": "Transforming Dialysis Care: Inside Oak Lawn's State-of-the-Art Facility - Dialysis Care Center",
  "text": "Dialysis Care Center About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Admissions Find A Center Find A Center Search Search Close this search box. Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Transforming Dialysis Care: Inside Oak Lawn's State-of-the-Art Facility June 02, 2024 Located at 4457 Southwest Highway, Oak Lawn, IL 60453, the new Dialysis Care Center and Kidney Care Center comprise a comprehensive facility that provides state-of-the-art kidney care. The impressive 24,690–square-foot complex marks a significant milestone as KCC also celebrates 20 years of service to the community.Dialysis Care Center: Patient-Centric DesignSuite 100, on the first floor, houses the Dialysis Care Center, overseen by Medical Director Dr. Sushant Taksande. The DCC team includes a clinic manager, 2 Staff Nurses, 5 Patient Care Technicians, 1 Administration Assistant, and 1 Biomed Technician. The facility offers 14 heated reclining treatment chairs with tablets and an isolation room catering to patients’ diverse needs. Dialysis Care Center operates three shifts a day that can accommodate 84 patients, with plans to expand to 28 chairs per shift, increasing the total capacity to 148. The DCC’s advanced infrastructure and patient-centric design underscore our dedication to expanding our services and presence in the community.We are also excited to announce the opening of our Home Dialysis Clinic on the 2nd floor of our Oak Lawn building. This facility highlights our commitment to offering exceptional care for patients who prefer managing their dialysis treatments at home. Kidney Care Center: Advanced Medical TechnologyThe Kidney Care Center occupies Suite 201 on the second floor, featuring 12 patient exam rooms equipped with advanced medical technology to ensure top-quality care. The center also includes an in-house laboratory, enhancing diagnostic capabilities and providing quick and accurate test results. Patients benefit from Athena, an Electronic Medical Records (EMR) system, which allows them to access their medical records online seamlessly. The center is staffed by 5 Nephrologists, 1 Nurse Practitioner, 1 Practice Manager, and 5 Medical Assistants, all dedicated to delivering personalized and comprehensive kidney care. This state-of-the-art facility, one of its kind in the region, exemplifies our commitment to expanding the business and footprint of KCC.Welcoming and Comfortable SpacesThe facility features a spacious, inviting lobby, welcoming patients with comfortable seating and a calming atmosphere. The waiting area is designed to provide a relaxing environment and is equipped with modern amenities to make the wait time pleasant and stress-free. Additionally, there are several well-appointed meeting rooms available for consultations and staff meetings, ensuring privacy and a professional setting for discussions. These thoughtfully designed spaces provide our patients and staff with a seamless and positive experience.Leading the Way in Kidney HealthTogether, the DCC and KCC offer a full spectrum of kidney care services in a cutting-edge environment, emphasizing comfort, convenience, and the highest standards of medical excellence. This new facility is a beacon of hope and health, ready to meet the community’s needs with unparalleled precision and compassion. Join us in celebrating this milestone and witness the future of kidney care in Oak Lawn.Open House EventWe welcomed everyone to the new DCC and KCC facility with an open house event. The guests included physicians, nurses, and healthcare workers from across the town. The event showcased our state-of-the-art facilities and innovative kidney care solutions, allowing the community to meet our dedicated team. Guests toured the state-of-the-art facility, enjoyed refreshments, and networked with one another, sharing their excitement about the new center’s capabilities. The enthusiastic participation and support from local healthcare professionals underscored our commitment to redefining healthcare excellence in Oak Lawn. Here are a few glimpses from the event: Share: Dialysis Care Center AL AK AZ AR CA CO CT DE FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY DC Explore LocationsServicesDCC CaresEventsNews Useful Links CareersMy DCCPartnersContact UsBlogsPay My Bill DCC Customer Care Center 708-713-5080 Useful Links Locations | Services | DCC Care | Careers | Contact Us Admissions 844-466-3436 309-808-4352 admissions@dccdialysis.com​ Admissions: 844-466-3436 309-808-4352 admissions@dccdialysis.com​ This site is for informational purposes only and is not intended to be a substitute for professional medical advice, diagnosis or treatment.© 2025. DIALYSIS CARE CENTER. ALL RIGHTS RESERVED #LeadingwithCare Chair-time schedule guaranteed within 2 hours Talk to our admissions specialist Call 844-466-3436 or email us at admissions@dccdialysis.com​"
}