{
  "url": "https://dccdialysis.com/stories/dcc-missed-treatments-program/",
  "title": "DCC Missed Treatments Program - Dialysis Care Center",
  "text": "Dialysis Care Center About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Admissions Find A Center Find A Center Search Search Close this search box. Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Every Session Counts: DCC's New Initiative for Dialysis Treatment Adherence April 19, 2024 Patient well-being is our top priority at Dialysis Care Center. We understand that dialysis is vital to our patients’ health, and missing treatments can have serious consequences. This is why we’ve launched the Campaign “Every Dialysis Treatment Saves Lives,” which focuses on the critical importance of adhering to a dialysis schedule.Why is Staying on Schedule Important?Missing dialysis treatments can be very dangerous. Dialysis removes waste and extra fluids from your blood, which helps keep your body healthy. When you miss a treatment, these waste products can build up in your system, leading to serious health problems. These problems can include feeling weak and tired, high blood pressure, heart problems, and even seizures.The Missed Treatment Intervention TeamThe Missed Treatment Intervention Team at DCC is more than just a group of specialists— they’re your partners in dialysis care. Their job is to ensure patients receive the essential dialysis treatments to stay healthy. Imagine them as your own personal support system for dialysis. Every day, they diligently monitor our Electronic Health Records (EHR). When they see a patient has missed their scheduled appointment, they spring into action.Here’s how our team ensures that you never miss a dialysis session:Monitoring: The team monitors our electronic health records (EHR) closely throughout the day.Reaching Out: If they see that someone has missed their appointment by more than an hour, they’ll call them right away.Contacting Someone You Trust: If they can’t reach them directly, they’ll call someone from their emergency contact list.Rescheduling Your Treatment: The team will explain the importance of the missed treatment and work with the patient to get them back on track. They can help reschedule the treatment for the same day or later that week.Transportation Assistance: The team won’t leave the patient stranded if transportation is an issue. They’ll work with them to find a way to get them to their appointment safely.Celebrating Patient Commitment with DCC ChampionsWe understand the importance of patients committing to their dialysis schedules. This is why we celebrate our incredible patients who consistently adhere to their dialysis schedules and consider them our DCC Champions. These patients take care of their health and inspire others by demonstrating the power of their commitment and resilience. DCC Champions will be honored at ceremonies within their respective clinics every quarter, receiving awards for their dedication to their health.Recognizing Exceptional Caregivers with DCC LifesaversAs a part of this campaign, we celebrate our amazing staff. The DCC Lifesavers program acknowledges exceptional DCC caregivers and staff who play a vital role in supporting and motivating patients during dialysis treatments. These dedicated professionals build strong, caring relationships with patients, ensuring treatment adherence and providing a positive and supportive environment. We will celebrate these fantastic Lifesavers each quarter through recognition ceremonies with awards, acknowledging their unwavering commitment to exceptional patient care.DCC’s Missed Treatment Campaign demonstrates our dedication to improving patient’s health. Through this initiative, we aim to assist our dialysis patients in maintaining their dialysis regimen and ensuring they feel their best.If you have any questions about your dialysis schedule or the Missed Treatment Intervention Campaign, please don’t hesitate to contact your doctor or nurse at DCC. We’re always here to support you! Share: Dialysis Care Center AL AK AZ AR CA CO CT DE FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY DC Explore LocationsServicesDCC CaresEventsNews Useful Links CareersMy DCCPartnersContact UsBlogsPay My Bill DCC Customer Care Center 708-713-5080 Useful Links Locations | Services | DCC Care | Careers | Contact Us Admissions 844-466-3436 309-808-4352 admissions@dccdialysis.com​ Admissions: 844-466-3436 309-808-4352 admissions@dccdialysis.com​ This site is for informational purposes only and is not intended to be a substitute for professional medical advice, diagnosis or treatment.© 2025. DIALYSIS CARE CENTER. ALL RIGHTS RESERVED #LeadingwithCare Chair-time schedule guaranteed within 2 hours Talk to our admissions specialist Call 844-466-3436 or email us at admissions@dccdialysis.com​"
}