{
  "url": "https://dccdialysis.com/stories/celebrating-brittany-jones/",
  "title": "Celebrating Brittany Jones: A Dedication to Dialysis Care",
  "text": "Dialysis Care Center About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Admissions Find A Center Find A Center Search Search Close this search box. Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Celebrating Brittany Jones Brittany JonesHome Modality Specialist Brittany’s Background DCC is delighted to have Brittany Jones, a Home Modality Specialist, as a valuable member of DCC Hershey and DCC Lebanon clinics. Her unwavering dedication and positive attitude have consistently earned her the admiration and pride of the entire DCC staff. Brittany has been in the dialysis field for years, and she started her career caring for patients in the In-Center dialysis setting. She then moved on to home therapy dialysis treatments. Brittany has worked in home therapy for 4 years and has extensive knowledge and experience. She had firsthand experience with her Dad being on dialysis. As a mother, daughter, and medical staff personnel, she empathizes with dialysis patients and would love to give her patients a better outlook on life. In-Center Clinic Work Brittany works with DCC Lebanon and DCC Hershey simultaneously. She emphasizes that organization and consistent communication are critical to an efficient and productive team. Through educating staff and patients, the clinics can stay on top of treatments and the patient’s health, which is a top priority. Accomplishments Her pride stems from achieving healthy hemoglobin levels for all her patients, a challenging accomplishment she finally realized in August 2023 and considers this because of a team effort. This achievement is tangible evidence that diligent effort and unwavering dedication yield meaningful results. With DCC Lebanon being a newer clinic, initially, getting every detail in order was hard. She is proud to say that with the help of Jacqueline Jeffers, Area Manager, and many others, DCC Lebanon has been state-certified. This gives the population more options with DCC Hershey and DCC Lebanon. Patients’ Lives Brittany’s foremost objective is to ensure that her patients continue to have an improved quality of life. She understands that dialysis is hard and in-center dialysis takes extra accommodations, and this can be daunting to patients. Brittany recounts a specific instance where she had a patient undergoing in-center dialysis who was on the verge of giving up. This was a compelling incentive to help improve the patient’s mental well-being. Brittany provided consistent support throughout the treatment process, ensuring timely medication administration. Eventually, she transitioned the patient to home dialysis, significantly enhancing his perspective on the dialysis experience. She is determined to ensure that where there’s a will, there’s a way for her patients. Home dialysis offers patients a sense of having more time for their daily activities. The PD census shows that DCC Hershey has the highest rating for patients to receive a transplant in the area. A patient from DCC Hershey recently had a kidney transplant on 7th September successfully. Brittany invests substantial time and effort in developing a deep understanding of her patients. She firmly believes in minimizing unnecessary clinic visits for her patients by maintaining treatment consistency, thus reducing hospitalizations and the need for higher medication dosages. This patient-centric approach fosters high company morale, stemming from a collective commitment to prioritizing patient well-being and working together. Dialysis Care Center AL AK AZ AR CA CO CT DE FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY DC Explore LocationsServicesDCC CaresEventsNews Useful Links CareersMy DCCPartnersContact UsBlogsPay My Bill DCC Customer Care Center 708-713-5080 Useful Links Locations | Services | DCC Care | Careers | Contact Us Admissions 844-466-3436 309-808-4352 admissions@dccdialysis.com​ Admissions: 844-466-3436 309-808-4352 admissions@dccdialysis.com​ This site is for informational purposes only and is not intended to be a substitute for professional medical advice, diagnosis or treatment.© 2025. DIALYSIS CARE CENTER. ALL RIGHTS RESERVED #LeadingwithCare Chair-time schedule guaranteed within 2 hours Talk to our admissions specialist Call 844-466-3436 or email us at admissions@dccdialysis.com​"
}