{
  "url": "https://dccdialysis.com/stories/remembering-andrea-spraggins/",
  "title": "Remembering Andrea Spraggins: A Dedicated Social Worker",
  "text": "Dialysis Care Center About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Admissions Find A Center Find A Center Search Search Close this search box. Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Remembering Andrea Spraggins Andrea SpragginsDCC Social Worker With great sadness, the DCC family says goodbye to Andrea Spraggins, who passed away on February 20th, 2022. Andrea was a DCC Social Worker in our Georgia region starting in September 2021. In our eyes, Andrea Spraggins was a hero. What makes someone a hero? We define it as the person who uses their time on Earth to impact people’s lives positively. Remembered by those she worked with for her passion, Andrea dedicated her career to helping patients understand that dialysis is a part of their life, not their entire life. Andrea was an advocate for organ donation and worked tirelessly to make sure her patients understood the importance of being healthy and prepared for any opportunity. As a proud Delta Sigma Theta sorority member, Andrea was deeply involved in community service in the African American community. She brought her spirit and passion to everything she did at work and in her everyday life. Andrea joined the Dialysis Care Center family in September of 2021 as a Social Worker at the South Fulton and Hapeville, Georgia, locations. Throughout her time at DCC, Andrea always advocated to patients the importance of adjusting positively to life on dialysis and working hard to maintain their new lifestyles. She worked extensively with her co-worker Kim Birdsong to help educate patients on the importance of not missing dialysis treatments. Regarding Andrea’s talents, Birdsong said, “Working with patients is where Andrea’s talents were best exhibited, and she was always happy to share her experiences.” As an organ recipient, Andrea’s unique perspective helped her relate to patients personally. Social Worker Manager Dawn Gromley says that Andrea could relate to her patients in a way not everyone can. Andrea’s openness about her experiences made her a vital part of the team. Gromley also says that although Andrea’s time with DCC was beginning, she positively impacted the Social Work team. Although Andrea’s time at Dialysis Care Center was cut short, she will be remembered as a champion for her patients. We want to honor her memory and share what made Andrea a hero to those around her. The DCC Family will miss her. Dialysis Care Center AL AK AZ AR CA CO CT DE FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY DC Explore LocationsServicesDCC CaresEventsNews Useful Links CareersMy DCCPartnersContact UsBlogsPay My Bill DCC Customer Care Center 708-713-5080 Useful Links Locations | Services | DCC Care | Careers | Contact Us Admissions 844-466-3436 309-808-4352 admissions@dccdialysis.com​ Admissions: 844-466-3436 309-808-4352 admissions@dccdialysis.com​ This site is for informational purposes only and is not intended to be a substitute for professional medical advice, diagnosis or treatment.© 2025. DIALYSIS CARE CENTER. ALL RIGHTS RESERVED #LeadingwithCare Chair-time schedule guaranteed within 2 hours Talk to our admissions specialist Call 844-466-3436 or email us at admissions@dccdialysis.com​"
}