{
  "url": "https://dccdialysis.com/stories/celebrating-sharon-walters/",
  "title": "Celebrating Sharon Walters - Dialysis Care Center",
  "text": "Dialysis Care Center About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Admissions Find A Center Find A Center Search Search Close this search box. Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Celebrating Sharon Walters Sharon WaltersPatient Care Technician When Sharon Walters began working in dialysis 26 years ago, she was looking for a more stable career to allow her time to spend with her young daughter. Since then, she has become a leader in her clinic and works tirelessly to provide the best care for her patients. Connecting to patients and being someone they can relate to and trust is one of the things Walters enjoys most about working as a Patient Care Technician (PCT.) Initially working for Home Dialysis Services, Walters enjoyed working in the home program and going to patients’ homes to help them with their treatment. Walters says that gaining patients’ trust in the home programs is essential because they invite you into their homes. People who work in home programs need to understand that responsibility and take it seriously. When HDS changed to DCC, Walters stayed on and helped with the transition to opening the clinic. Walters has been with Dialysis Care Center for nearly seven years and attributes her longevity with the company to the teamwork in her clinic. The teamwork between the different departments is something Walters enjoys about working at DCC. On her team, Walters said, “It is nice to have a team that will be there for you and pick up slack when you need it. And I will help anyone who needs my help; that’s what teammates do.” Upon reflection on her career in dialysis, Walters has advice for anyone interested in becoming a PCT: “Hang in there; there are going to be many new things you will need to learn to be successful, but learn it and learn it well.” Dialysis Care Center AL AK AZ AR CA CO CT DE FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY DC Explore LocationsServicesDCC CaresEventsNews Useful Links CareersMy DCCPartnersContact UsBlogsPay My Bill DCC Customer Care Center 708-713-5080 Useful Links Locations | Services | DCC Care | Careers | Contact Us Admissions 844-466-3436 309-808-4352 admissions@dccdialysis.com​ Admissions: 844-466-3436 309-808-4352 admissions@dccdialysis.com​ This site is for informational purposes only and is not intended to be a substitute for professional medical advice, diagnosis or treatment.© 2025. DIALYSIS CARE CENTER. ALL RIGHTS RESERVED #LeadingwithCare Chair-time schedule guaranteed within 2 hours Talk to our admissions specialist Call 844-466-3436 or email us at admissions@dccdialysis.com​"
}